/* Localizable strings not stored in nib files and not stored in application resources, */
/* the strings below can be accessed using the GetBundleLocalizedString() macro, those */
/* stored in application resources must be accessed using GetLocalizedString() instead. */

/* Share Points automount sheet strings */
"kMntExpHomeDir"	= "This share point will host group folders or user home folders. The folder will be mounted on the user’s computer in /Network/Servers.";
"kMntExpSharedApps"	= "The contents of this share point will appear on client computers in /Network/Applications.";
"kMntExpSharedLib"	= "The contents of this share point will appear on client computers in /Network/Library.";
"kMntExpOther"		= "The contents of this share point will appear on client computers in the specified folder.";

"Enter an administrator's name and password for the directory domain:" = "Enter an administrator's name and password for the directory domain:";

"kRemoveAutomountDSAuthInformativeText" = "Removing a share point's automount record requires administrator privileges for the directory where the record is stored.";
"kChangeSharePointNameWithAutomountDSAuthInformativeText" = "Changing the name of an automounted share point requires administrator privileges for the directory where the record is stored.";
"kRemoveSharePointWithAutomountDSAuthInformativeText" = "Removing a share point with an automount record requires administrator privileges for the directory where the record is stored.";
"kAutomountInfoErrAlertTtl" = "Authentication failure.";
"kAutomountInfoErrAlertMsg" = "The Open Directory administrator name and password failed to authenticate against the selected Open Directory domain. \nRetype the name and password and try again.";
"kAutomountInfoErrMsg" = "Incorrect user name or password.";

"kHomeFolders" = "Home Folders";
"kSharedAppsFolder" = "Shared Applications folder";
"kSharedLibFolder" = "Shared Library folder";

/* Share Points Time Machine strings */
"kUnsupportedTimeMachineDiskWarning" = "This disk drive may not support Time Machine backup over the network. Get %@ about compatible drives.";
"kUnsupportedTimeMachineDiskError" = "This disk drive does not support Time Machine backup over the network. Get %@ about compatible drives.";
"kUnsupportedTimeMachineDiskURLText" = "more information";
"kUnsupportedTimeMachineDiskURL" = "http://docs.info.apple.com/article.html?artnum=306332";

/* Share Points... nfs attributes */

"kNFSAnyAuth"		= "Any";
"kNFSStandardAuth"	= "Standard";
"kNFSKerberosAuth"	= "Kerberos";

"kNFSRootToRootMap" = "Root To Root";
"kNFSAllToNobodyMap"= "All To Nobody";

"kEveryone" = "Everyone";

/* Share Points... */

"kHideDetailsTitle"	= "Hide Settings";
"kShowDetailsTitle"	= "Edit Settings";

"kGoToPrivs" = "Edit access permissions for \"%@\"";

"User:" = "User:";
"Group:" = "Group:";

/* File Privs: Errors */
"kPermissionsItemGenericError"  = "An error occurred while reading permissions for the selected item";
"kPermissionsItemNotFoundError" = "The selected file system item could not be found";
"kPropagationFailedError"		= "Propagation of permissions failed";
"kInheritFailedError"			= "An error occurred while attempting to get the inherited ACEs from the parent";

/* File Privs: folder ACL related */
"ag_Administration"				= "Administration";
"ACL_WRITE_SECURITY"			= "Change Permissions";
"ACL_CHANGE_OWNER"				= "Change Owner";

"ag_Read"						= "Read";
"ACL_READ_ATTRIBUTES"			= "Read Attributes";
"ACL_READ_EXTATTRIBUTES"		= "Read Extended Attributes";
"ACL_LIST_DIRECTORY"			= "List Folder Contents (Read Data)";
"ACL_SEARCH"					= "Traverse Folder (Execute File)";
"ACL_READ_SECURITY"				= "Read Permissions";

"ag_Write"						= "Write";
"ACL_WRITE_ATTRIBUTES"			= "Write Attributes";
"ACL_WRITE_EXTATTRIBUTES"		= "Write Extended Attributes";
"ACL_ADD_FILE"					= "Create Files (Write Data)";
"ACL_ADD_SUBDIRECTORY"			= "Create Folder (Append Data)";
"ACL_DELETE"					= "Delete";
"ACL_DELETE_CHILD"				= "Delete Subfolders and Files";

/* File Privs:  file ACL related */
"ACL_READ_DATA"					= "Read Data";
"ACL_EXECUTE"					= "Execute File";

"ACL_WRITE_DATA"				= "Write Data";
"ACL_APPEND_DATA"				= "Append Data";

"ag_Inheritence"				= "Applies to";
"ACL_ENTRY_FILE_INHERIT"		= "Child files";
"ACL_ENTRY_DIRECTORY_INHERIT"	= "Child folders";
"ACL_ENTRY_LIMIT_INHERIT"		= "All descendants";
"ACL_ENTRY_ONLY_INHERIT"		= "This folder";

"kEntryIsInherited"				= "This entry is inherited from the parent folder";

"kAppThisFile"					= "This file";
"kAppThis"						= "This folder";
"kAppFolders"					= "Child folders";
"kAppFiles"						= "Child files";
"kAppDescendants"				= "All descendants";
"kAppliesToJoiner"				= ", ";

"kFullControl"					= "Full Control";
"kReadAndWrite"					= "Read & Write";
"kReadOnly"						= "Read Only";
"kWriteOnly"					= "Write Only";
"kRead"							= "Read";
"kWrite"						= "Write";
"kCustom"						= "Custom";
"Custom..."						= "Custom...";
"No Access"						= "No Access";

"kOthers"						= "Others";

"kAllow"						= "Allow";
"kDeny"							= "Deny";

"kACL"							= "ACL";
"kPOSIX"						= "POSIX";

"kYes"							= "Yes";
"kNo"							= "No";

"kPrivsMark"					= "√";

"kSavePending"					= "Save pending...";

/* File Privs: gear popup menu items */
"gearSortCanonically"			= "Sort Access Control List Canonically";
"gearMakeExplicit"				= "Make Inherited Entries Explicit";
"gearFileRemoveACL"				= "Remove Access Control List";
/* "gearFileApplyInherit"			= "Apply inheritance to selected file"; */
"gearFileApplyInherit"			= "Inherit Entries from Parent Folder";
"gearDirRemoveInherited"		= "Remove Inherited Entries";
"gearDirPropagate"				= "Propagate Permissions…";
"gearShowEffectivePrivs"		= "Show Effective Permissions Inspector";

"kACLOnFileErrorTitle"			= "Operation not allowed on Tiger server.";
"kACLOnFileErrorMessage"		= "You cannot add explicit entries to the access control list for files. The only access control entries a file may have are those which it inherits from its parent folder.";

/* NFS Resharing */
"kNFSMountErrorTitle"				= "The NFS mount operation failed.";
"kNFSMountGenericErrorMessage"		= "The NFS export could not be mounted. Reenter the URL and try again.";
"kNFSMountFolderAlreadyExistsErrorMessage" = "The mount point for the given NFS export URL already exists.";
"kNFSMountPermissionErrorMessage"	= "The operation could not complete because of insufficient privileges";
"kNFSMountUnknownCommandErrorMessage" = "An unknown command was encountered.";

"kConfirmNFSVolumeUnmountTitle" = "Unmount the selected NFS volume?";
"kConfirmNFSVolumeUnmountMessage" = "All share points associated with the NFS volume will no longer be accessible.";

"kNFSUnmountErrorTitle"				= "The NFS unmount operation failed.";
"kNFSUnmountGenericErrorMessage"	= "The NFS export could not be unmounted. Please Try again";

//"Mount NFS export for resharing..." = "Mount NFS export for resharing...";
//"Unmount NFS export" = "Unmount NFS Export";

"Do you want to remove the automount settings for the selected share point?" = "Do you want to remove the automount settings for the selected share point?";
"Remove..." = "Remove...";
"Review Settings" = "Review Settings";
"Cancel" = "Cancel";
"Removing the automount settings will prevent clients from mounting the share point automatically." = "Removing the automount settings will prevent clients from mounting the share point automatically.";

"Choose a volume or folder to use as a new share point." = "Choose a volume or folder to use as a new share point.";

"Nested NFS share points are not allowed." = "Nested NFS share points are not allowed.";
"The share point \"%@\" is inside the share point \"%@\".  Please unshare one of these share points, or disable NFS exporting on one of these share points." = "The share point \"%@\" is inside the share point \"%@\".  Please unshare one of these share points, or disable NFS exporting on one of these share points.";

"Propagating permissions on items owned by root is not recommended. For example, /System and /Library are owned by root. Altering their permissions could lead to unexpected behavior." = "Propagating permissions on items owned by root is not recommended. For example, /System and /Library are owned by root. Altering their permissions could lead to unexpected behavior.";
"Changing permissions on items owned by root is not recommended. For example, /System and /Library are owned by root. Altering their permissions could lead to unexpected behavior." = "Changing permissions on items owned by root is not recommended. For example, /System and /Library are owned by root. Altering their permissions could lead to unexpected behavior.";

/* Overview panel strings */
/* not currently used */
"Total Share Points:" = "Total Share Points:";
//"Shared by AFP:" = "Shared by AFP:";
//"Shared by SMB:" = "Shared by SMB:";
//"Shared by FTP:" = "Shared by FTP:";
//"Shared by NFS:" = "Shared by NFS:";

/* popup menu itmes */
"Add to favorites" = "Add to Favorites";
//"New folder..." = "New Folder...";				/* not currently used */
//"Mount NFS volume..." = "Mount NFS Volume...";	/* not currently used */
//"Unmount NFS Volume" = "Unmount NFS Volume";	/* not currently used */
//"kMountNfsShare" = "Mount NFS Share";
//"kUnmountNfsShare" = "Unmount NFS Share";
"kShareThisItem" = "Share";
"kUnshareThisItem" = "Unshare";

/* column info */
" Free: %@" = "Free: %@";
//" Shared over: " = " Shared over: ";
//"   Guest access:  " = "   Guest access:  ";
"kEnabled" = "Enabled";
"kDisabled" = "Disabled";

"kAFP" = "AFP";
"kFTP" = "FTP";
"kNFS" = "NFS";
"kSMB" = "SMB";

/* Browser volume list view tool tips */
"kDiskSpaceToolTipFormat" = "%@ of %@ used (%d%%)";
"kQuotasToolTip" = "Quotas are enabled for this volume.";
"kNoQuotasToolTip" = "Quotas are not enabled for this volume.";

/* Browser share point list view tool tips */
"kAutomountToolTipFormat" = "This item is automatically mounted using the %@ protocol on client machines.";
"kNoAutomountToolTip" = "This item is not automatically mounted.";
"kGuestAccessProtocolsToolTipFormat1" = "Guest access is enabled when connecting to this item over the %@ protocol.";
"kGuestAccessProtocolsToolTipFormat2" = "Guest access is enabled when connecting to this item over the %@ and %@ protocols.";
"kGuestAccessProtocolsToolTipFormat3" = "Guest access is enabled when connecting to this item over the %@, %@, and %@ protocols.";
"kNoGuestAccessProtocolsToolTip" = "Guest access is not enabled for this item";
"kSharedProtocolsToolTipFormat1" = "This item is shared over the %@ protocol.";
"kSharedProtocolsToolTipFormat2" = "This item is shared over the %@ and %@ protocols.";
"kSharedProtocolsToolTipFormat3" = "This item is shared over the %@, %@, and %@ protocols.";
"kSharedProtocolsToolTipFormat4" = "This item is shared over the %@, %@, %@, and %@ protocols.";
"kNoSharedProtocolsToolTip" = "This item is not shared.";
"kSpotlightToolTip" = "This item has Spotlight indexing enabled.";
"kNoSpotlightToolTip" = "This item does not have Spotlight indexing enabled.";
"kTimeMachineToolTip" = "This item is available as a Time Machine backup destination.";
"kNoTimeMachineToolTip" = "This item is not available as a Time Machine backup destination.";